new1start1VS/stm32-key-led/6-5/System/Timer.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

extern uint16_t Num;

void Timer_Init(void)
{
    RCC_APB1PeriphClockCmd (RCC_APB1Periph_TIM2,ENABLE);
    
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    
    GPIO_Init (GPIOA, &GPIO_InitStructure);
    
    TIM_ETRClockMode2Config(TIM2,TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted, 0X0f); 
    
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruture;
    TIM_TimeBaseInitStruture.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStruture.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStruture.TIM_Period = 10 - 1;
    TIM_TimeBaseInitStruture.TIM_Prescaler = 1 - 1;
    TIM_TimeBaseInitStruture.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit (TIM2,&TIM_TimeBaseInitStruture);
    
    TIM_ClearFlag (TIM2,TIM_FLAG_Update );//为了避免复位
    //从1开始计数使用一个清楚的操作来完成这个
    TIM_ITConfig (TIM2, TIM_IT_Update ,ENABLE);
    
    NVIC_PriorityGroupConfig (NVIC_PriorityGroup_2);
    
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_Init(&NVIC_InitStructure);
    
    TIM_Cmd(TIM2,ENABLE);
}

uint16_t Timer_GetCounter(void)
{
    return TIM_GetCounter(TIM2);
}    

void TIM2_IRQHandler (void)
{   
    Delay_ms(400);
    if (TIM_GetITStatus (TIM2, TIM_IT_Update) == SET )
    {
        Delay_ms(400);
        Num ++;
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    }
    
}
